# Series

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
#series one dimensional

series = pd.Series([-3, 5, 6, 4, 5], index=['a', 'b', 'c', 'd', 'e'])

In [3]:
series

a   -3
b    5
c    6
d    4
e    5
dtype: int64

In [4]:
#two dimension array 

data = {'country': ['Pakistan', 'India', 'Bangladesh', 'Sri Lanka', 'Nepal'],
    'capital' : ['Islamabad', 'New Delhi', 'Dhaka', 'Colombo', 'Khatmandu'],
    'population' : [2166, 1380, 1660, 2150, 34255]}
df = pd.DataFrame(data, columns=['country', 'capital', 'population'], index=[1, 2, 3, 4, 5])

In [5]:
df

      country    capital  population
1    Pakistan  Islamabad        2166
2       India  New Delhi        1380
3  Bangladesh      Dhaka        1660
4   Sri Lanka    Colombo        2150
5       Nepal  Khatmandu       34255

# Dropping values

In [6]:
#dropping or removing a column from a dataframe in pandas
series.drop(['a', 'c']) # dropping or removing a column from a single dimension series with 0 axis in pandas

b    5
d    4
e    5
dtype: int64

In [7]:
# dropping or removing a column from a two dimension series with axis in pandas
df.drop('country', axis=1)

     capital  population
1  Islamabad        2166
2  New Delhi        1380
3      Dhaka        1660
4    Colombo        2150
5  Khatmandu       34255

In [8]:
df

      country    capital  population
1    Pakistan  Islamabad        2166
2       India  New Delhi        1380
3  Bangladesh      Dhaka        1660
4   Sri Lanka    Colombo        2150
5       Nepal  Khatmandu       34255

# Asking pandas for help

In [9]:
#write help and in () write whatever topic you want to cover
help(pd.Series.loc)

Help on property:

    Access a group of rows and columns by label(s) or a boolean array.

    ``.loc[]`` is primarily label based, but may also be used with a
    boolean array.

    Allowed inputs are:

    - A single label, e.g. ``5`` or ``'a'``, (note that ``5`` is
      interpreted as a *label* of the index, and **never** as an
      integer position along the index).
    - A list or array of labels, e.g. ``['a', 'b', 'c']``.
    - A slice object with labels, e.g. ``'a':'f'``.

      .. warning:: Note that contrary to usual python slices, **both** the
          start and the stop are included

    - A boolean array of the same length as the axis being sliced,
      e.g. ``[True, False, True]``.
    - An alignable boolean Series. The index of the key will be aligned before
      masking.
    - An alignable Index. The Index of the returned selection will be the input.
    - A ``callable`` function with one argument (the calling Series or
      DataFrame) and that returns valid output for indexing (one of the above)

    See more at :ref:`Selection by Label <indexing.label>`.

    Raises
    ------
    KeyError
        If any items are not found.
    IndexingError
        If an indexed key is passed and its index is unalignable to the frame index.

    See Also
    --------
    DataFrame.at : Access a single value for a row/column label pair.
    DataFrame.iloc : Access group of rows and columns by integer position(s).
    DataFrame.xs : Returns a cross-section (row(s) or column(s)) from the
                   Series/DataFrame.
    Series.loc : Access group of values using labels.

    Examples
    --------
    **Getting values**

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...                   index=['cobra', 'viper', 'sidewinder'],
    ...                   columns=['max_speed', 'shield'])
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4       5
    sidewinder          7       8

    Single label. Note this returns the row as a Series.

    >>> df.loc['viper']
    max_speed    4
    shield       5
    Name: viper, dtype: int64

    List of labels. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[['viper', 'sidewinder']]
                max_speed  shield
    viper               4       5
    sidewinder          7       8

    Single label for row and column

    >>> df.loc['cobra', 'shield']
    2

    Slice with labels for row and single label for column. As mentioned
    above, note that both the start and stop of the slice are included.

    >>> df.loc['cobra':'viper', 'max_speed']
    cobra    1
    viper    4
    Name: max_speed, dtype: int64

    Boolean list with the same length as the row axis

    >>> df.loc[[False, False, True]]
                max_speed  shield
    sidewinder          7       8

    Alignable boolean Series:

    >>> df.loc[pd.Series([False, True, False],
    ...                  index=['viper', 'sidewinder', 'cobra'])]
                         max_speed  shield
    sidewinder          7       8

    Index (same behavior as ``df.reindex``)

    >>> df.loc[pd.Index(["cobra", "viper"], name="foo")]
           max_speed  shield
    foo
    cobra          1       2
    viper          4       5

    Conditional that returns a boolean Series

    >>> df.loc[df['shield'] > 6]
                max_speed  shield
    sidewinder          7       8

    Conditional that returns a boolean Series with column labels specified

    >>> df.loc[df['shield'] > 6, ['max_speed']]
                max_speed
    sidewinder          7

    Multiple conditional using ``&`` that returns a boolean Series

    >>> df.loc[(df['max_speed'] > 1) & (df['shield'] < 8)]
                max_speed  shield
    viper          4       5

    Multiple conditional using ``|`` that returns a boolean Series

    >>> df.loc[(df['max_speed'] > 4) | (df['shield'] < 5)]
                max_speed  shield
    cobra               1       2
    sidewinder          7       8

    Please ensure that each condition is wrapped in parentheses ``()``.
    See the :ref:`user guide<indexing.boolean>`
    for more details and explanations of Boolean indexing.

    .. note::
        If you find yourself using 3 or more conditionals in ``.loc[]``,
        consider using :ref:`advanced indexing<advanced.advanced_hierarchical>`.

        See below for using ``.loc[]`` on MultiIndex DataFrames.

    Callable that returns a boolean Series

    >>> df.loc[lambda df: df['shield'] == 8]
                max_speed  shield
    sidewinder          7       8

    **Setting values**

    Set value for all items matching the list of labels

    >>> df.loc[['viper', 'sidewinder'], ['shield']] = 50
    >>> df
                max_speed  shield
    cobra               1       2
    viper               4      50
    sidewinder          7      50

    Set value for an entire row

    >>> df.loc['cobra'] = 10
    >>> df
                max_speed  shield
    cobra              10      10
    viper               4      50
    sidewinder          7      50

    Set value for an entire column

    >>> df.loc[:, 'max_speed'] = 30
    >>> df
                max_speed  shield
    cobra              30      10
    viper              30      50
    sidewinder         30      50

    Set value for rows matching callable condition

    >>> df.loc[df['shield'] > 35] = 0
    >>> df
                max_speed  shield
    cobra              30      10
    viper               0       0
    sidewinder          0       0

    Add value matching location

    >>> df.loc["viper", "shield"] += 5
    >>> df
                max_speed  shield
    cobra              30      10
    viper               0       5
    sidewinder          0       0

    Setting using a ``Series`` or a ``DataFrame`` sets the values matching the
    index labels, not the index positions.

    >>> shuffled_df = df.loc[["viper", "cobra", "sidewinder"]]
    >>> df.loc[:] += shuffled_df
    >>> df
                max_speed  shield
    cobra              60      20
    viper               0      10
    sidewinder          0       0

    **Getting values on a DataFrame with an index that has integer labels**

    Another example using integers for the index

    >>> df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
    ...                   index=[7, 8, 9], columns=['max_speed', 'shield'])
    >>> df
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    Slice with integer labels for rows. As mentioned above, note that both
    the start and stop of the slice are included.

    >>> df.loc[7:9]
       max_speed  shield
    7          1       2
    8          4       5
    9          7       8

    **Getting values with a MultiIndex**

    A number of examples using a DataFrame with a MultiIndex

    >>> tuples = [
    ...     ('cobra', 'mark i'), ('cobra', 'mark ii'),
    ...     ('sidewinder', 'mark i'), ('sidewinder', 'mark ii'),
    ...     ('viper', 'mark ii'), ('viper', 'mark iii')
    ... ]
    >>> index = pd.MultiIndex.from_tuples(tuples)
    >>> values = [[12, 2], [0, 4], [10, 20],
    ...           [1, 4], [7, 1], [16, 36]]
    >>> df = pd.DataFrame(values, columns=['max_speed', 'shield'], index=index)
    >>> df
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Single label. Note this returns a DataFrame with a single index.

    >>> df.loc['cobra']
             max_speed  shield
    mark i          12       2
    mark ii          0       4

    Single index tuple. Note this returns a Series.

    >>> df.loc[('cobra', 'mark ii')]
    max_speed    0
    shield       4
    Name: (cobra, mark ii), dtype: int64

    Single label for row and column. Similar to passing in a tuple, this
    returns a Series.

    >>> df.loc['cobra', 'mark i']
    max_speed    12
    shield        2
    Name: (cobra, mark i), dtype: int64

    Single tuple. Note using ``[[]]`` returns a DataFrame.

    >>> df.loc[[('cobra', 'mark ii')]]
                   max_speed  shield
    cobra mark ii          0       4

    Single tuple for the index with a single label for the column

    >>> df.loc[('cobra', 'mark i'), 'shield']
    2

    Slice from index tuple to single label

    >>> df.loc[('cobra', 'mark i'):'viper']
                         max_speed  shield
    cobra      mark i           12       2
               mark ii           0       4
    sidewinder mark i           10      20
               mark ii           1       4
    viper      mark ii           7       1
               mark iii         16      36

    Slice from index tuple to index tuple

    >>> df.loc[('cobra', 'mark i'):('viper', 'mark ii')]
                        max_speed  shield
    cobra      mark i          12       2
               mark ii          0       4
    sidewinder mark i          10      20
               mark ii          1       4
    viper      mark ii          7       1

    Please see the :ref:`user guide<advanced.advanced_hierarchical>`
    for more details and explanations of advanced indexing.

# Sort and Rank

In [10]:
df.sort_index()

      country    capital  population
1    Pakistan  Islamabad        2166
2       India  New Delhi        1380
3  Bangladesh      Dhaka        1660
4   Sri Lanka    Colombo        2150
5       Nepal  Khatmandu       34255

In [11]:
df.sort_values(by= 'country')

      country    capital  population
3  Bangladesh      Dhaka        1660
2       India  New Delhi        1380
5       Nepal  Khatmandu       34255
1    Pakistan  Islamabad        2166
4   Sri Lanka    Colombo        2150

In [12]:
df.rank() 
#ranking the values in the dataframe by the 'rank' column in descending order based on the 'rank' column

   country  capital  population
1      4.0      3.0         4.0
2      2.0      5.0         1.0
3      1.0      2.0         2.0
4      5.0      1.0         3.0
5      3.0      4.0         5.0

In [13]:
df_sorted = df.sort_values(by='population', ascending=False)

In [14]:
df_sorted

      country    capital  population
5       Nepal  Khatmandu       34255
1    Pakistan  Islamabad        2166
4   Sri Lanka    Colombo        2150
3  Bangladesh      Dhaka        1660
2       India  New Delhi        1380

In [15]:
df.to_csv('example.csv')

In [16]:
pd.read_csv('example.csv')

   Unnamed: 0     country    capital  population
0           1    Pakistan  Islamabad        2166
1           2       India  New Delhi        1380
2           3  Bangladesh      Dhaka        1660
3           4   Sri Lanka    Colombo        2150
4           5       Nepal  Khatmandu       34255

In [17]:
df.to_excel('multi.xlsx', sheet_name='Hello')

In [18]:
pd.read_excel('multi.xlsx') #to read an excel file

   Unnamed: 0     country    capital  population
0           1    Pakistan  Islamabad        2166
1           2       India  New Delhi        1380
2           3  Bangladesh      Dhaka        1660
3           4   Sri Lanka    Colombo        2150
4           5       Nepal  Khatmandu       34255

In [19]:
#to read a specific sheet
xlsx=pd.read_excel('multi.xlsx')
xlsx=pd.read_excel('multi.xlsx',sheet_name='Hello')

In [20]:
print(xlsx)

   Unnamed: 0     country    capital  population
0           1    Pakistan  Islamabad        2166
1           2       India  New Delhi        1380
2           3  Bangladesh      Dhaka        1660
3           4   Sri Lanka    Colombo        2150
4           5       Nepal  Khatmandu       34255

# Read and  Write to SQL Query or Database Table

In [21]:
import sqlalchemy as sql

In [22]:
from sqlalchemy import create_engine
from sqlalchemy import TEXT
from sqlalchemy import text

# Create an in-memory SQLite database engine
engine = create_engine('sqlite:///:memory:')

with engine.connect() as conn:
    with conn.begin():
        conn.execute(text("""
            CREATE TABLE my_table (
                id INTEGER PRIMARY KEY,
                name TEXT,
                age INTEGER
            )
        """))
        conn.execute(text("""
            INSERT INTO my_table (name, age) VALUES
            ('Alice', 30),
            ('Bob', 25),
            ('Charlie', 35)
        """))

# Now query the table using pandas
df1 = pd.read_sql('SELECT * FROM my_table;', engine)
print(df1)

df2 = pd.read_sql_table('my_table', engine)
print(df2)

df3 = pd.read_sql_query('SELECT * FROM my_table;', engine)
print(df3)

   id     name  age
0   1    Alice   30
1   2      Bob   25
2   3  Charlie   35
   id     name  age
0   1    Alice   30
1   2      Bob   25
2   3  Charlie   35
   id     name  age
0   1    Alice   30
1   2      Bob   25
2   3  Charlie   35

In [23]:
df

      country    capital  population
1    Pakistan  Islamabad        2166
2       India  New Delhi        1380
3  Bangladesh      Dhaka        1660
4   Sri Lanka    Colombo        2150
5       Nepal  Khatmandu       34255

In [24]:
df1

   id     name  age
0   1    Alice   30
1   2      Bob   25
2   3  Charlie   35

In [25]:
df2

   id     name  age
0   1    Alice   30
1   2      Bob   25
2   3  Charlie   35

In [26]:
df3

   id     name  age
0   1    Alice   30
1   2      Bob   25
2   3  Charlie   35

In [27]:
print (df3)

   id     name  age
0   1    Alice   30
1   2      Bob   25
2   3  Charlie   35

# GET something from a database

In [28]:
series['b']

5

In [29]:
df['capital']

1    Islamabad
2    New Delhi
3        Dhaka
4      Colombo
5    Khatmandu
Name: capital, dtype: object

In [30]:
#another way to do this is
df[1:]

      country    capital  population
2       India  New Delhi        1380
3  Bangladesh      Dhaka        1660
4   Sri Lanka    Colombo        2150
5       Nepal  Khatmandu       34255

# Selecting, Boolean Indexing &  Setting

In [31]:
#by position
df.iloc[0][1]

C:\Users\user\AppData\Local\Temp\ipykernel_2512\2062860837.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][1]

'Islamabad'

In [32]:
#another way to do it
df.iloc[0, 1]

'Islamabad'

In [33]:
#by label
df.loc[1,'country']

'Pakistan'

In [34]:
#by position/label

df.iloc[2]
df.loc[1, 'capital']

'Islamabad'

In [35]:
#boolean indexing

series[series>4] #for values greater than 4

b    5
c    6
e    5
dtype: int64

In [36]:
series

a   -3
b    5
c    6
d    4
e    5
dtype: int64

In [37]:
df

      country    capital  population
1    Pakistan  Islamabad        2166
2       India  New Delhi        1380
3  Bangladesh      Dhaka        1660
4   Sri Lanka    Colombo        2150
5       Nepal  Khatmandu       34255

In [38]:
df[df['population']>1500]

      country    capital  population
1    Pakistan  Islamabad        2166
3  Bangladesh      Dhaka        1660
4   Sri Lanka    Colombo        2150
5       Nepal  Khatmandu       34255

# Retrieving Series/DataFrame Information

In [39]:
df.shape

(5, 3)

In [40]:
df.index

Index([1, 2, 3, 4, 5], dtype='int64')

In [41]:
df.columns

Index(['country', 'capital', 'population'], dtype='object')

In [42]:
df.info

<bound method DataFrame.info of       country    capital  population
1    Pakistan  Islamabad        2166
2       India  New Delhi        1380
3  Bangladesh      Dhaka        1660
4   Sri Lanka    Colombo        2150
5       Nepal  Khatmandu       34255>

In [43]:
df.count

<bound method DataFrame.count of       country    capital  population
1    Pakistan  Islamabad        2166
2       India  New Delhi        1380
3  Bangladesh      Dhaka        1660
4   Sri Lanka    Colombo        2150
5       Nepal  Khatmandu       34255>

In [44]:
df.country

1      Pakistan
2         India
3    Bangladesh
4     Sri Lanka
5         Nepal
Name: country, dtype: object

In [45]:
df.index[2]

3

In [46]:
df.sum()

country         PakistanIndiaBangladeshSri LankaNepal
capital       IslamabadNew DelhiDhakaColomboKhatmandu
population                                      41611
dtype: object

In [47]:
df.cummax() #cummulative sum of max values

     country    capital  population
1   Pakistan  Islamabad        2166
2   Pakistan  New Delhi        2166
3   Pakistan  New Delhi        2166
4  Sri Lanka  New Delhi        2166
5  Sri Lanka  New Delhi       34255

In [48]:
numeric_df=df.select_dtypes(include='number')
result= [numeric_df.min(),
        numeric_df.max()]
result

[population    1380
 dtype: int64,
 population    34255
 dtype: int64]

In [49]:
df.describe()

         population
count      5.000000
mean    8322.200000
std    14500.724265
min     1380.000000
25%     1660.000000
50%     2150.000000
75%     2166.000000
max    34255.000000

In [50]:
df['population'].mean()

8322.2

# Applying functions

In [51]:
f = lambda x: x*2

In [52]:
df.apply(f)

                country             capital  population
1      PakistanPakistan  IslamabadIslamabad        4332
2            IndiaIndia  New DelhiNew Delhi        2760
3  BangladeshBangladesh          DhakaDhaka        3320
4    Sri LankaSri Lanka      ColomboColombo        4300
5            NepalNepal  KhatmanduKhatmandu       68510

In [53]:
df.applymap(f)

C:\Users\user\AppData\Local\Temp\ipykernel_2512\2173204005.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(f)

                country             capital  population
1      PakistanPakistan  IslamabadIslamabad        4332
2            IndiaIndia  New DelhiNew Delhi        2760
3  BangladeshBangladesh          DhakaDhaka        3320
4    Sri LankaSri Lanka      ColomboColombo        4300
5            NepalNepal  KhatmanduKhatmandu       68510